---
kind: method
id: M:Autodesk.Revit.DB.ScheduleField.SetStyle(Autodesk.Revit.DB.TableCellStyle)
source: html/9f0d0e2a-436d-85a6-e2ca-c703e6d11fb9.htm
---
# Autodesk.Revit.DB.ScheduleField.SetStyle Method

Sets the style of this field.

## Syntax (C#)
```csharp
public void SetStyle(
	TableCellStyle style
)
```

## Parameters
- **style** (`Autodesk.Revit.DB.TableCellStyle`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null